tap 'phinze/homebrew-cask'
tap 'TakatoshiMaeda/homebrew-mycask'

brew 'fontforge'
brew 'go'
brew 'brew-cask'
brew 'csshx'
brew 'erlang'
brew "git"
brew "git-flow"
brew "go"
brew "hub"
brew "imagemagick"
brew "jq"
brew "lua"
brew "lynx"
brew "macvim"
brew "mecab"
brew "mecab-ipadic"
brew "mongodb"
brew "msgpack"
brew "mysql"
brew "nginx"
brew "openssl"
brew "python"
brew "readline"
brew "redis"
brew "rrd-tool"
brew "rsense"
brew "rsync"
brew "ruby-build"
brew "scala"
brew "sqlite"
brew "http://toolbelt.treasuredata.com/brew/td-agent.rb"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"

cask "alfred"
cask "android-file-transfer"
cask "android-studio"
cask "apns-pusher"
cask "arduino"
cask "caffeine"
cask "chromium"
cask "chromatic"
cask "clipmenu"
cask "rest-client"
cask "crashlytics"
cask "cyberduck"
cask "dropbox"
cask "dropbox-encore"
cask "eclipse-platform"
cask "evernote"
cask "fluid"
cask "genymotion"
cask "github"
cask "gitx"
cask "google-chrome"
cask "google-drive"
cask "google-hangouts"
cask "google-web-designer"
cask "grooveshark"
cask "heroku-toolbelt"
cask "hipchat"
cask "mou"
cask "mysql-workbench"
cask "robomongo"
cask "sequel-pro"
cask "skype"
cask "sublime-text"
cask "testflight"
cask "virtualbox"
cask "vagrant"
cask "wireshark"

#cask "pivotal-booster"
#cask "line"
cask "kobito"
#cask "key-remap-4-macbook"
cask "elastic-fox-ec2tag"
cask "iam-fox"
cask "r53-fox"
